rkz/extension/Documents/ЗаказНаПроизводство2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказНаПроизводство2_2</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипПроизводственногоПроцесса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПроизводственныхПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовНаПроизводство2_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПотребности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачатьНеРанее</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ПереданВПроизводство</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Продукция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоляСтоимости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отменено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПричинаОтмены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныОтменыПроизводства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АналитикаАктивовПассивов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиАктивовПассивов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоляСтоимостиНаЕдиницу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СписатьНаРасходы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АналитикаРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КлючНоменклатура</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

rkz/extension/Documents/ЗаказНаПроизводство2_2/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	
	// {{ПервыйБИТ ЛистТребований [ЛТ9] [ASHolyavko@1cbit.ru] [20.08.2024] +        
	
	Если НЕ РольДоступна("бит_ПравоРедактированияКомментария")
		И НЕ РольДоступна("ПолныеПрава") Тогда
		
		Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
			
			Если Объект.ДокументОснование.Статус <> Перечисления.СтатусыЗаказовКлиентов.НеСогласован Тогда	
				
				Элементы.Комментарий.ТолькоПросмотр = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	// }}ПервыйБИТ ЛистТребований [ЛТ9] [ASHolyavko@1cbit.ru] [20.08.2024] -
	
	
	// {{ПервыйБИТ ЛистТребований [ЛТ12] [ASHolyavko@1cbit.ru] [20.08.2024] +        
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_Толеранс", Тип("ПолеФормы"), Элементы.ГруппаОсновноеЛево);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Толеранс";
	НовыйЭлемент.Заголовок = "(бит) Толеранс";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ12] [ASHolyavko@1cbit.ru] [20.08.2024] - 
	
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] +        
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_ПереданВПроизводство", Тип("ПолеФормы"), Элементы.ГруппаОсновноеЛево);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ПереданВПроизводство";
	НовыйЭлемент.Заголовок = "(бит) Передан в производство";
	
	Если бит_ЗаказСодержитНоменклатуруВключеннуюВСуточныйПакет() Тогда  		
		НовыйЭлемент.ТолькоПросмотр = ЛОЖЬ;		
	КонецЕсли; 
	
	Если НЕ (РольДоступна("бит_ОтделПроизводства") Или РольДоступна("ПолныеПрава")) Тогда 
		НовыйЭлемент.ТолькоПросмотр = ИСТИНА;		
	КонецЕсли;

// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] -

	// {{ПервыйБИТ ЛистТребований [ЛТ5.20] [ASHolyavko@1cbit.ru] [04.08.2025] +        
	
	НовыйЭлемент = Элементы.Добавить("бит_ВидЗаказа", Тип("ПолеФормы"), Элементы.ГруппаОсновноеШапка); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ВидЗаказа";
	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.20] [ASHolyavko@1cbit.ru] [04.08.2025] -
		
	// {{ПервыйБИТ ЛистТребований [ЛТ5.30] [ASHolyavko@1cbit.ru] [05.09.2025] +        
	
	НовыйЭлемент = Элементы.Добавить("бит_ТипТары", Тип("ПолеФормы"), Элементы.Продукция); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.ПутьКДанным = "Объект.Продукция.бит_ТипТары";
	
	НовыйЭлемент = Элементы.Добавить("бит_КоличествоТары", Тип("ПолеФормы"), Элементы.Продукция); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.ПутьКДанным = "Объект.Продукция.бит_КоличествоТары";
	
	НовыйЭлемент = Элементы.Добавить("бит_ТолерансПродукция", Тип("ПолеФормы"), Элементы.Продукция); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.ПутьКДанным = "Объект.Продукция.бит_Толеранс";
	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.30] [ASHolyavko@1cbit.ru] [05.09.2025] -	
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.8.1]  [VUVaynula@1cbit.ru] [01.02.2026 21:03:44] +        
	НовыйЭлемент = Элементы.Добавить("бит_НомерПартииКатанки", Тип("ПолеФормы"), Элементы.ГруппаОсновноеЛево); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	НовыйЭлемент.ПутьКДанным = "Объект.бит_НомерПартииКатанки";
	// }}ПервыйБИТ ЛистТребований [ЛТ5.8.1]  [VUVaynula@1cbit.ru] [01.02.2026 21:03:44] -
КонецПроцедуры   

&НаСервере
&После("ПослеЗаписиНаСервере")
Процедура бит_ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] +  
	
	Если бит_ЗаказСодержитНоменклатуруВключеннуюВСуточныйПакет() Тогда  	
		Элементы.бит_ПереданВПроизводство.ТолькоПросмотр = ЛОЖЬ;		
	Иначе		
		Элементы.бит_ПереданВПроизводство.ТолькоПросмотр = ИСТИНА;	
	КонецЕсли;
	
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] -

КонецПроцедуры

&НаКлиенте
Процедура бит_ПродукцияПриИзмененииПосле(Элемент) 
	
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] + 
		
	Если бит_ЗаказСодержитНоменклатуруВключеннуюВСуточныйПакет() Тогда  		
		Этаформа.Элементы.бит_ПереданВПроизводство.ТолькоПросмотр = ЛОЖЬ;
	Иначе
		Этаформа.Элементы.бит_ПереданВПроизводство.ТолькоПросмотр = ИСТИНА;
	КонецЕсли;
	
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] -

КонецПроцедуры

&НаКлиенте
&После("ВставитьСтроки")
Процедура бит_ВставитьСтроки(Команда)

// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] + 
		
	Если бит_ЗаказСодержитНоменклатуруВключеннуюВСуточныйПакет() Тогда  		
		Этаформа.Элементы.бит_ПереданВПроизводство.ТолькоПросмотр = ЛОЖЬ;
	Иначе
		Этаформа.Элементы.бит_ПереданВПроизводство.ТолькоПросмотр = ИСТИНА;
	КонецЕсли;
	
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] -

КонецПроцедуры

&НаСервере
Функция бит_ЗаказСодержитНоменклатуруВключеннуюВСуточныйПакет() Экспорт
	
// }}ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] +      

	ПродукцияЗаказа = Новый ТаблицаЗначений;
	ПродукцияЗаказа = Объект.Продукция.Выгрузить(,"Номенклатура");
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	ТЗ.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ вт_ТаблицаЗначений
		|ИЗ
		|	&ТаблицаЗначений КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИСТИНА КАК НеВключатьВСуточныйПакет,
		|	вт_ТаблицаЗначений.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ вт_НоменклатураВключенаВСуточныйПакет
		|ИЗ
		|	вт_ТаблицаЗначений КАК вт_ТаблицаЗначений
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_НеВключатьВСуточныйПакет КАК бит_НеВключатьВСуточныйПакет
		|		ПО (вт_ТаблицаЗначений.Номенклатура.Родитель = бит_НеВключатьВСуточныйПакет.бит_ГруппаНоменклатуры
		|    ИЛИ вт_ТаблицаЗначений.Номенклатура.Родитель.Родитель = бит_НеВключатьВСуточныйПакет.бит_ГруппаНоменклатуры
		|    ИЛИ вт_ТаблицаЗначений.Номенклатура.Родитель.Родитель.Родитель = бит_НеВключатьВСуточныйПакет.бит_ГруппаНоменклатуры
		|    ИЛИ вт_ТаблицаЗначений.Номенклатура.Родитель.Родитель.Родитель.Родитель = бит_НеВключатьВСуточныйПакет.бит_ГруппаНоменклатуры)
		|ГДЕ
		|	НЕ бит_НеВключатьВСуточныйПакет.ПометкаУдаления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ТаблицаЗначений.Номенклатура КАК Номенклатура
		|ИЗ
		|	вт_ТаблицаЗначений КАК вт_ТаблицаЗначений
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_НоменклатураВключенаВСуточныйПакет КАК вт_НоменклатураВключенаВСуточныйПакет
		|		ПО (вт_ТаблицаЗначений.Номенклатура = вт_НоменклатураВключенаВСуточныйПакет.Номенклатура)
		|ГДЕ
		|	ЕСТЬNULL(вт_НоменклатураВключенаВСуточныйПакет.НеВключатьВСуточныйПакет, 0) = 0");  
	
	Запрос.УстановитьПараметр("ТаблицаЗначений", ПродукцияЗаказа);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда 
		Возврат ЛОЖЬ;		
	Иначе 
		Возврат ИСТИНА;		
	КонецЕсли;	
	
// }}ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] - 
	
КонецФункции

&НаКлиенте
Процедура бит_ПродукцияНазначениеПриИзмененииПосле(Элемент)
		
	// {{ПервыйБИТ ЛистТребований [ЛТ5.30] [ASHolyavko@1cbit.ru] [22.10.2025] +        
	
	ТекущиеДанные = Элементы.Продукция.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ТекущиеДанные.бит_ТипТары = Неопределено;
		ТекущиеДанные.бит_КоличествоТары = 0;
		ТекущиеДанные.бит_Толеранс = 0;
		
		Если ЗначениеЗаполнено(ТекущиеДанные.Назначение) 
			И ЕстьЗаказКлиентаВНазначении(ТекущиеДанные.Назначение) Тогда
			
			Структура = ПолучитьТипТарыИКоличество(ТекущиеДанные.Назначение, ТекущиеДанные.Номенклатура);
			
			ТекущиеДанные.бит_ТипТары = Структура.бит_ТипТары;
			ТекущиеДанные.бит_КоличествоТары = Структура.бит_КоличествоТары;
			ТекущиеДанные.бит_Толеранс = Структура.бит_Толеранс
			
		Иначе
			
			МассивМатериалов = Новый Массив;
			ПолучитьМатериалыСпецификации(ТекущиеДанные.Спецификация, МассивМатериалов, Объект.Дата);
			
			ТекущиеДанные.бит_ТипТары = УстановитьТипТарыПоСпецификации(МассивМатериалов);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.30] [ASHolyavko@1cbit.ru] [22.10.2025] -
	
КонецПроцедуры

&НаСервере
Функция УстановитьТипТарыПоСпецификации(МассивМатериалов)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ВидНоменклатуры В (&ВидНоменклатурыТара)
		|	И Номенклатура.Ссылка В(&МассивНоменклатуры)";
	
	Запрос.УстановитьПараметр("ВидНоменклатурыТара", Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.Тара, ЭтотОбъект));
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивМатериалов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
		
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПолучитьОсновнуюСпецификацию(Номенклатура, НачалоПроизводства)
	
	ПараметрыВыбораСпецификаций = УправлениеДаннымиОбИзделияхКлиентСервер.ПараметрыВыбораСпецификаций();
	ПараметрыВыбораСпецификаций.Вставить("ПолучитьСпецификацииПоНоменклатуре", Истина);
	ПараметрыВыбораСпецификаций.Вставить("ПолучитьСпецификацииПоСпискуНоменклатуры", Ложь);
	ПараметрыВыбораСпецификаций.Вставить("ИгнорируемыеПараметрыНазначения", Новый Массив);
	ПараметрыВыбораСпецификаций.Вставить("ИгнорируемыеУточненияПрименения", Новый Массив);
	
	ДанныеОбИзделии = УправлениеДаннымиОбИзделияхКлиентСервер.СтруктураДанныхОбИзделииДляВыбораСпецификации();
	ДанныеОбИзделии.Номенклатура = Номенклатура;	
	ДанныеОбИзделии.НачалоПроизводства = НачалоПроизводства;
	
	Результат = УправлениеДаннымиОбИзделиях.СпецификацииИзделия(ДанныеОбИзделии, ПараметрыВыбораСпецификаций);
	
	ИсключитьСпецификацию = Справочники.РесурсныеСпецификации.ПустаяСсылка();
	
	Спецификации             = Новый Массив;
	ПриоритетнаяСпецификация = Справочники.РесурсныеСпецификации.ПустаяСсылка();
	
	Для Индекс = 0 По Результат.ВГраница() Цикл
		ТекущаяСпецификация = Результат[Индекс].Спецификация;
		Если ПриоритетнаяСпецификация.Пустая()
				И Результат[Индекс].ПодбираетсяАвтоматически = Истина Тогда
			ПриоритетнаяСпецификация = ТекущаяСпецификация;
		КонецЕсли;
		Если ТекущаяСпецификация <> ИсключитьСпецификацию Тогда
			Спецификации.Добавить(ТекущаяСпецификация);
		КонецЕсли;
	КонецЦикла;	
	
	Возврат ПриоритетнаяСпецификация;
	
КонецФункции

&НаСервере
Функция ПолучитьМатериалыСпецификации(Спецификация, МассивСтруктурМатериалов, НачалоПроизводства)
	
	Попытка
		
		Для Каждого СтрокаМатериалы Из Спецификация.МатериалыИУслуги Цикл
			
			Если СтрокаМатериалы.ПроизводитсяВПроцессе 
				И СтрокаМатериалы.СпособПолученияМатериала = Перечисления.СпособыПолученияМатериаловВСпецификации.ПроизвестиПоСпецификации Тогда
							
				СпецификацияНоменклатуры = ПолучитьОсновнуюСпецификацию(СтрокаМатериалы.Номенклатура, НачалоПроизводства);
				ПолучитьМатериалыСпецификации(СпецификацияНоменклатуры, МассивСтруктурМатериалов, НачалоПроизводства);
							
			Иначе
				
							
				//СтруктураМатериалов = Новый Структура;
				//СтруктураМатериалов.Вставить("Номенклатура", СтрокаМатериалы.Номенклатура);
				
								
				МассивСтруктурМатериалов.Добавить(СтрокаМатериалы.Номенклатура);                    
				
			КонецЕсли;
			
		КонецЦикла;	
		
	Исключение
		
		Сообщить(ОписаниеОшибки());
		
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция ЕстьЗаказКлиентаВНазначении(Назначение) 
	Возврат ЗначениеЗаполнено(Назначение.Заказ);
КонецФункции

&НаСервере
Функция ПолучитьТипТарыИКоличество(Назначение, Номенклатура) 

	Результат = Новый Структура;
	Результат.Вставить("бит_ТипТары", Неопределено);
	Результат.Вставить("бит_КоличествоТары", 0);
	Результат.Вставить("бит_Толеранс", 0);
	
	ОтборСтрок = Новый Структура;
	ОтборСтрок.Вставить("Номенклатура", Номенклатура);
	
	НайденныеСтрок = Назначение.Заказ.Товары.НайтиСтроки(ОтборСтрок);

	Если НайденныеСтрок.Количество() <> 0 Тогда
		Результат.бит_ТипТары = НайденныеСтрок[0].бит_ТипТары;
		Результат.бит_КоличествоТары = НайденныеСтрок[0].бит_КоличествоТары;
		Результат.бит_Толеранс = НайденныеСтрок[0].бит_Толеранс;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура бит_ПродукцияСпецификацияПриИзмененииПосле(Элемент)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.30] [ASHolyavko@1cbit.ru] [22.10.2025] +        
	
	ТекущиеДанные = Элементы.Продукция.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
				
		Если ЗначениеЗаполнено(ТекущиеДанные.Назначение) 
			И ЕстьЗаказКлиентаВНазначении(ТекущиеДанные.Назначение) Тогда
			
			//Структура = ПолучитьТипТарыИКоличество(ТекущиеДанные.Назначение, ТекущиеДанные.Номенклатура);
			//
			//ТекущиеДанные.бит_ТипТары = Структура.бит_ТипТары;
			//ТекущиеДанные.бит_КоличествоТары = Структура.бит_КоличествоТары;
			//ТекущиеДанные.бит_Толеранс = Структура.бит_Толеранс
			
		Иначе
			
			МассивМатериалов = Новый Массив;
			ПолучитьМатериалыСпецификации(ТекущиеДанные.Спецификация, МассивМатериалов, Объект.Дата);
			
			ТекущиеДанные.бит_ТипТары = УстановитьТипТарыПоСпецификации(МассивМатериалов);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.30] [ASHolyavko@1cbit.ru] [22.10.2025] -

КонецПроцедуры
